Revit 2027 API
SunAndShadowSettings.UsesDST Property
 Identifies whether the SunAndShadowSettings element is using daylight savings time.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UsesDST { get; }
Public ReadOnly Property UsesDST As Boolean
	Get
public:
property bool UsesDST {
	bool get ();
}
member UsesDST : bool with get
Property Value
Boolean
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace